<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_13(8%EC%9B%941%EC%9D%BC).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

job_list = [{'name': 'John', 'job': "teacher"},
            {'name': 'Nate', 'job': "teacher"},
            {'name': 'Fred', 'job': "teacher"},
            {'name': 'Abraham', 'job': "student"},
            {'name': 'Brian', 'job': "student"},
            {'name': 'Janny', 'job': "developer"},
            {'name': 'Nate', 'job': "teacher"},
            {'name': 'Ian', 'job': "teacher"},
            {'name': 'Chris', 'job': "banker"},
            {'name': 'Janny', 'job': "basketball player"},
            {'name': 'Gwen', 'job': "teacher"},
            {'name': 'Jessy', 'job': "student"}
            ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

In [3]:
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7       Ian            teacher
8     Chris             banker
9     Janny  basketball player
10     Gwen            teacher
11    Jessy            student

In [4]:
df.job.unique() # job 안의 value들이 유니크하게 나옴

array(['teacher', 'student', 'developer', 'banker', 'basketball player'],
      dtype=object)

In [5]:
df.job.value_counts() # job별의 개수 확인

teacher              6
student              3
developer            1
banker               1
basketball player    1
Name: job, dtype: int64